// ------------------------------------------------
// 1) Бібліотека iziToast - щоб підключити CSS код бібліотеки в проєкт, необхідно додати ще один імпорт, крім того, що описаний в документації.
// ------------------------------------------------
// Описаний у документації
import iziToast from 'izitoast';
// Додатковий імпорт стилів
import 'izitoast/dist/css/iziToast.min.css';
// ------------------------------------------------

const form = document.querySelector('.form');

form.addEventListener('submit', event => {
  event.preventDefault();

  const delay = Number(form.elements.delay.value);
  const state = form.elements.state.value;
  createPromise(delay, state)
    .then(delay => {
      iziToast.show({
        // title: 'Success',
        message: `✅ Fulfilled promise in ${delay}ms`,
        position: 'topRight',
        messageSize: '16px',
        messageColor: '#fff',
        backgroundColor: '#59a10d',
      });
    })
    .catch(delay => {
      iziToast.show({
        // title: 'Error',
        message: `❌ Rejected promise in ${delay}ms`,
        position: 'topRight',
        messageSize: '16px',
        messageColor: '#fff',
        // backgroundColor: '#ef4040',
        backgroundColor: '#E87070',
      });
    })
    .finally(() => {
      form.reset();
    });
});

function createPromise(delay, state) {
  return new Promise((resolve, reject) => {
    setTimeout(() => {
      if (state === 'fulfilled') {
        resolve(delay);
      } else {
        reject(delay);
      }
    }, delay);
  });
}

// ---------------------------------------------
// Завдання 2 - Генератор промісів
// ---------------------------------------------
// Виконуй це завдання у файлах 2-snackbar.html і 2-snackbar.js. Подивися демовідео роботи генератора промісів.

// Додай в HTML файл розмітку форми. Форма складається з поля вводу для введення значення затримки в мілісекундах, двох радіокнопок, які визначають те, як виконається проміс, і кнопки з типом submit, при кліку на яку має створюватися проміс.

// ---------------------------------------------
// <form class="form">
//   <label>
//     Delay (ms)
//     <input type="number" name="delay" required />
//   </label>

//   <fieldset>
//     <legend>State</legend>
//     <label>
//       <input type="radio" name="state" value="fulfilled" required />
//       Fulfilled
//     </label>
//     <label>
//       <input type="radio" name="state" value="rejected" required />
//       Rejected
//     </label>
//   </fieldset>

//   <button type="submit">Create notification</button>
// </form>
// ---------------------------------------------

// Напиши скрипт, який після сабміту форми створює проміс. В середині колбека цього промісу через вказану користувачем кількість мілісекунд проміс має виконуватися (при fulfilled) або відхилятися (при rejected), залежно від обраної опції в радіокнопках. Значенням промісу, яке передається як аргумент у методи resolve/reject, має бути значення затримки в мілісекундах.

// Створений проміс треба опрацювати у відповідних для вдалого/невдалого виконання методах.

// Якщо проміс виконується вдало, виводь у консоль наступний рядок, де delay — це значення затримки виклику промісу в мілісекундах.
// ---------------------------------------------
// `✅ Fulfilled promise in ${delay}ms`
// ---------------------------------------------

// Якщо проміс буде відхилено, то виводь у консоль наступний рядок, де delay — це значення затримки промісу в мілісекундах.
// ---------------------------------------------
// `❌ Rejected promise in ${delay}ms`
// ---------------------------------------------

// ---------------------------------------------
// Бібліотека повідомлень
// ---------------------------------------------
// Для відображення повідомлень, замість console.log(), використовуй бібліотеку iziToast. Для того щоб підключити CSS код бібліотеки в проєкт, необхідно додати ще один імпорт, крім того, що описаний у документації.
// ---------------------------------------------
// // Описаний у документації
// import iziToast from "izitoast";
// // Додатковий імпорт стилів
// import "izitoast/dist/css/iziToast.min.css";
// ---------------------------------------------

// ---------------------------------------------
// На що буде звертати увагу ментор при перевірці:
// ---------------------------------------------
// Підключена бібліотека iziToast.
// При обранні стану в радіокнопках і натисканні на кнопку Create notification з’являється повідомлення, відповідного до обраного стану стилю, із затримкою в кількість мілісекунд, переданих в інпут.
// Повідомлення, що виводиться, містить тип обраного стейту і кількість мілісекунд згідно з шаблоном в умові.
